# StairGetOptTotalRise

## Description
Returns Stair Total Rise Option.

```pascal
FUNCTION StairGetOptTotalRise(stair : HANDLE) : INTEGER;
```

```python

def vs.StairGetOptTotalRise(stair):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE||

## Version
Availability: from Vectorworks 2021
## Category
* Objects - Stairs